#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	int i = 9;
 0 0000000 000000000000000000001001	- 补码
存入pfloat,以浮点数形式，返回：
	(-1)^0 * 0.000000000000000000001001 * 2^(-126)
	  ->0 极小，所以打印0.00000
	float* pfloat = (float*)&i;
	printf("i     =%d\n", i);
	printf("pfloat=%f\n", *pfloat);
 
	*pfloat = 9.0;
 (-1)^0 * 1.001 * 2 ^ 3E
存   0 10000010 00100000000000000000000
	 S    E+127		M
	即 0100000100010000000000000000 ，0正数，原反补相同，直接打印%d
	printf("i     =%d\n",i);
	printf("pfloat=%f\n", *pfloat);
	return 0;
 }

int main()
{
 	float i = 9.0;
	float* pfloat = (float*)&i;
 以float形式存在内存里
 9.0 - (-1)^0 * 1.001 (1001.0) * 2^3E
		 (-1)^S *	M			 * 2^?E
 	  存储时 S + (E+127) + M有效位			32位float共23位E，+127 | 64位double共52位E,+1023
 				  2(真实值)+127	=129(存储值)						M 共8位		   |		M共11位
	0 10000010 00100000000000000000000
  0100 0001 0001 0000 0000 0000 0000 0000
0x 4	  1    1    0    0    0    0  0
0x41100000

 5.5 - (-1)^0* 1.011*2^2E
 0.5 - (-1)^0* 1.0*2^(-1)E
 
 	0 10000010 00100000000000000000000 
 还原: (-1)^0 *1.001*2^(129-127)E		E不为全0/1
 E全为0 - +-无限接近0
 E全为1 - +-无限大
 
	float i= 0x41100000;
	printf("%lf", i);
	return 0;
}